aaron-bond.better-comments
alefragnani.project-manager
alexcvzz.vscode-sqlite
angular.ng-template
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cyrilletuzi.angular-schematics
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
dotjoshjohnson.xml
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
hashicorp.terraform
johnpapa.angular-essentials
johnpapa.angular2
johnpapa.vscode-peacock
johnpapa.winteriscoming
kisstkondoros.vscode-gutter-preview
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
mtxr.sqltools
naumovs.color-highlight
oderwat.indent-rainbow
pkief.material-icon-theme
pnp.polacode
postman.postman-for-vscode
redhat.vscode-xml
redhat.vscode-yaml
saeris.markdown-github-alerts
steoates.autoimport
stivo.tailwind-fold
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
task.vscode-task
timonwong.shellcheck
ms-python.python
ms-python.vscode-pylance
ms-vscode.vscode-typescript-next
svelte.svelte-vscode
# Package Managers
pnpm.pnpm
# Database Tools
cweijan.vscode-postgresql-client2
ms-ossdata.vscode-postgresql
mtxr.sqltools
mtxr.sqltools-driver-pg
# Kubernetes & Container Tools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-containers
# Infrastructure as Code (OpenTofu/Terraform)
hashicorp.terraform
# API Testing
humao.rest-client
rangav.vscode-thunder-client
# Security & DevSecOps
aquasecurity.trivy-vscode-extension
# Cloudflare
cloudflare.cloudflare-workers
# Capacitor (Mobile)
ionic.ionic
# Additional Python Tools
ms-python.black-formatter
ms-python.isort
# Configuration Files
tamasfe.even-better-toml
redhat.vscode-yaml
